# language: ru


Функционал: Калькулятор, проверка деления
  Структура сценария: Деление двух чисел
    Допустим введены два числа <a> и <b>
    Если разделить
    То получим <result>

    Примеры:
      | a    | b    | result  |
      | 3.8  | 2.5  | 1.52       |
      | 0    | 2.1  | 0          |
      | -3.2 | 2.5  | -1.28      |
      | 2.1  | -3.2 | -0.65625   |
      | -2.1 | -3.2 | 0.65625    |
      | 0    | -3.2 |  -0        |
      | 3.2  | -3.2 | -1         |
      | 3.2  | 3.2  | 1          |

  Структура сценария: Первое не введено
    Допустим введено только первое число <a>
    Если разделить
    То произойдет <error>

    Примеры:
      | a    | error            |
      | 3.2  | Первый аргумент пустой! |
      | -3.2 | Первый аргумент пустой! |
      | 0    | Первый аргумент пустой! |


  Структура сценария: Второе не введено
    Допустим введено только второе число <b>
    Если разделить
    То произойдет <error>

    Примеры:
      | b    | error            |
      | 3.2  | Второй аргумент пустой! |
      | -3.2 | Второй аргумент пустой! |
      | 0    | Второй аргумент пустой! |

  Структура сценария: Второе число равно нулю, а первое нет
    Допустим введены два числа <a> и <b>
    Если разделить
    То произойдет <error>

    Примеры:
      | a      | b    | error                                                  |
      | 3.2    | 0    | Second argument is zero. Divide by zero is not allowed. |
      | -2.1   | 0    | Second argument is zero. Divide by zero is not allowed. |
      | 0      | 0    | Second argument is zero. Divide by zero is not allowed. |