# language: ru
# encoding: windows-1251

Функционал: Калькулятор, проверка деления
  Структура сценария: Деление двух чисел
    Допустим введены два числа <a> и <b>
    Если разделить
    То получим <результат>

    Примеры:
      | a    | b    | результат  |
      | 3.8  | 2.5  | 1.52       |
      | 0    | 2.1  | 0          |
      | -3.2 | 2.5  | -1.28      |
      | 2.1  | -3.2 | -0.65625   |
      | -2.1 | -3.2 | 0.65625    |
      | 0    | -3.2 |  -0        |
      | 3.2  | -3.2 | -1         |
      | 3.2  | 3.2  | 1          |

  Структура сценария: Первое не введено
    Допустим введено только первое число <a>
    Если разделить
    То произойдет <ошибка>

    Примеры:
      | a    | ошибка            |
      | 3.2  | Argument is null. |
      | -3.2 | Argument is null. |
      | 0    | Argument is null. |


  Структура сценария: Второе не введено
    Допустим введено только второе число <b>
    Если разделить
    То произойдет <ошибка>

    Примеры:
      | b    | ошибка            |
      | 3.2  | Argument is null. |
      | -3.2 | Argument is null. |
      | 0    | Argument is null. |

  Структура сценария: Второе число равно нулю, а первое нет
    Допустим введены два числа <a> и <b>
    Если разделить
    То произойдет <ошибка>

    Примеры:
      | a      | b    | ошибка                                                  |
      | 3.2    | 0    | Second argument is zero. Divide by zero is not allowed. |
      | -2.1   | 0    | Second argument is zero. Divide by zero is not allowed. |
      | 0      | 0    | Second argument is zero. Divide by zero is not allowed. |